// 表示用のレイアウト定義
export const tableLayout = [
  // --- ア ---
  { label: 'ア', chars: ['ア', 'イ', 'ウ', 'エ', 'オ'] },
  { label: 'イェ', chars: ['', '', '', 'イェ', ''] },
  { label: 'ウァ', chars: ['ウァ', 'ウィ', '', 'ウェ', 'ウォ'] },

  // --- ヴ ---
  { label: 'ヴ', chars: ['ヴァ', 'ヴィ', 'ヴ', 'ヴェ', 'ヴォ'] },
  { label: 'ヴャ', chars: ['ヴャ', '', 'ヴュ', '', 'ヴョ'] },

  // --- カ ---
  { label: 'カ', chars: ['カ', 'キ', 'ク', 'ケ', 'コ'] },
  { label: 'キャ', chars: ['キャ', 'キィ', 'キュ', 'キェ', 'キョ'] },
  { label: 'クァ', chars: ['クァ', 'クィ', 'クゥ', 'クェ', 'クォ'] },
  { label: 'クャ', chars: ['クャ', '', 'クュ', '', 'クョ'] },

  // --- ガ ---
  { label: 'ガ', chars: ['ガ', 'ギ', 'グ', 'ゲ', 'ゴ'] },
  { label: 'ギャ', chars: ['ギャ', 'ギィ', 'ギュ', 'ギェ', 'ギョ'] },
  { label: 'グァ', chars: ['グァ', 'グィ', 'グゥ', 'グェ', 'グォ'] },

  // --- サ ---
  { label: 'サ', chars: ['サ', 'シ', 'ス', 'セ', 'ソ'] },
  { label: 'シャ', chars: ['シャ', 'シィ', 'シュ', 'シェ', 'ショ'] },
  { label: 'スァ', chars: ['スァ', 'スィ', 'スゥ', 'スェ', 'スォ'] },

  // --- ザ ---
  { label: 'ザ', chars: ['ザ', 'ジ', 'ズ', 'ゼ', 'ゾ'] },
  { label: 'ジャ', chars: ['ジャ', 'ジィ', 'ジュ', 'ジェ', 'ジョ'] },

  // --- タ ---
  { label: 'タ', chars: ['タ', 'チ', 'ツ', 'テ', 'ト'] },
  { label: 'チャ', chars: ['チャ', 'チィ', 'チュ', 'チェ', 'チョ'] },
  { label: 'ツァ', chars: ['ツァ', 'ツィ', '', 'ツェ', 'ツォ'] },
  { label: 'テャ', chars: ['テャ', 'ティ', 'テュ', 'テェ', 'テョ'] },
  { label: 'トァ', chars: ['トァ', 'トィ', 'トゥ', 'トェ', 'トォ'] },

  // --- ダ ---
  { label: 'ダ', chars: ['ダ', 'ヂ', 'ヅ', 'デ', 'ド'] },
  { label: 'ヂャ', chars: ['ヂャ', 'ヂィ', 'ヂュ', 'ヂェ', 'ヂョ'] },
  { label: 'デャ', chars: ['デャ', 'ディ', 'デュ', 'デェ', 'デョ'] },
  { label: 'ドァ', chars: ['ドァ', 'ドィ', 'ドゥ', 'ドェ', 'ドォ'] },

  // --- ナ ---
  { label: 'ナ', chars: ['ナ', 'ニ', 'ヌ', 'ネ', 'ノ'] },
  { label: 'ニャ', chars: ['ニャ', 'ニィ', 'ニュ', 'ニェ', 'ニョ'] },

  // --- ハ ---
  { label: 'ハ', chars: ['ハ', 'ヒ', 'フ', 'ヘ', 'ホ'] },
  { label: 'ヒャ', chars: ['ヒャ', 'ヒィ', 'ヒュ', 'ヒェ', 'ヒョ'] },
  { label: 'ファ', chars: ['ファ', 'フィ', 'フゥ', 'フェ', 'フォ'] },
  { label: 'フャ', chars: ['フャ', '', 'フュ', '', 'フョ'] },

  // --- バ ---
  { label: 'バ', chars: ['バ', 'ビ', 'ブ', 'ベ', 'ボ'] },
  { label: 'ビャ', chars: ['ビャ', 'ビィ', 'ビュ', 'ビェ', 'ビョ'] },

  // --- パ ---
  { label: 'パ', chars: ['パ', 'ピ', 'プ', 'ペ', 'ポ'] },
  { label: 'ピャ', chars: ['ピャ', 'ピィ', 'ピュ', 'ピェ', 'ピョ'] },

  // --- マ ---
  { label: 'マ', chars: ['マ', 'ミ', 'ム', 'メ', 'モ'] },
  { label: 'ミャ', chars: ['ミャ', 'ミィ', 'ミュ', 'ミェ', 'ミョ'] },

  // --- ヤ ---
  { label: 'ヤ', chars: ['ヤ', '', 'ユ', '', 'ヨ'] },

  // --- ラ ---
  { label: 'ラ', chars: ['ラ', 'リ', 'ル', 'レ', 'ロ'] },
  { label: 'リャ', chars: ['リャ', 'リィ', 'リュ', 'リェ', 'リョ'] },

  // --- ワ ---
  { label: 'ワ', chars: ['ワ', 'ヰ', '', 'ヱ', 'ヲ'] },

  // --- 小書き・ン ---
  { label: '撥音', chars: ['ン', '', '', '', ''] },
  { label: '促音', chars: ['', '', 'ッ', '', ''] },
  { label: '小', chars: ['ァ', 'ィ', 'ゥ', 'ェ', 'ォ'] },
  { label: '小', chars: ['ヵ', '', '', 'ヶ', ''] },
  { label: '小', chars: ['ャ', '', 'ュ', '', 'ョ'] },
  { label: '記号', chars: ['、', '。', 'ー', '', ''] },
]
